Revit 2026 API

# RoofComponents Class

---

A class that contains multiple roof slab infos of a roof.

SystemObject Autodesk.Revit.DB.IFCRoofComponents

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class RoofComponents : IDisposable
```
```vb
Public Class RoofComponents
	Implements IDisposable
```
```cpp
public ref class RoofComponents : IDisposable
```
```fsharp
type RoofComponents =
    class
        interface IDisposable
    end
```

The RoofComponents type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | ScaledDepth | The depth of the roof slab. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the RoofComponents |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetAreasOfCurveLoops | The areas of CurveLoops of roof slabs. |
|  | GetCurveLoops | The CurveLoops of roof slabs. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetLoopFaces | The faces of the loops of roof slabs. |
|  | GetPlaneDirections | The plane directions of roof slabs. |
|  | GetPlaneOrigins | The plane origins of roof slabs. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

This class contains a series of collections that are all of the same length, and whose nth index corresponds to the nth slab of the roof.

#### Reference

Autodesk.Revit.DB.IFC Namespace